import type { SerializedStyles } from '@emotion/react';

type Props = {
  containerStyles?: SerializedStyles;
};

const TermsPrivacy = (props: Props) => (
  <div css={props.containerStyles}>
    “오블리브의원”은 (이하 ‘병원’은) 고객님의 개인정보를 중요시하며, “정보통신망
    이용촉진 및 정보보호”에 관한 법률을 준수하고 있습니다.
    <br />
    병원은 개인정보취급방침을 통하여 고객님께서 제공하시는 개인정보가 어떠한
    용도와 방식으로 이용되고 있으며,
    <br />
    개인정보보호를 위해 어떠한 조치를 취해지고 있는지 알려드립니다. 병원은
    개인정보취급방침을 개정하는 경우 웹사이트 공지사항(또는 개별공지)을 통하여
    공지할 것입니다.
    <br />
    수집하는 개인의 항목
    <br />
    개인정보의 수집 이용목적
    <br />
    개인정보의 보유 및 이용기간
    <br />
    개인정보의 파기절차 및 방법
    <br />
    이용자 및 법정대리인의 권리와 그 행사방법
    <br />
    개인정보 자동수집장치의 설치, 운영 및 그 거부에 관한 사항
    <br />
    동의철회(회원탈퇴)
    <br />
    만 14세 미만의 아동 개인정보관리
    <br />
    개인정보 관리책임자
    <br />
    개인정보침해관련 상담 및 신고
    <br />
    부칙
    <br />
    <br />
    수집하는 개인의 항목
    <br />
    병원은 상담, 서비스신청 등을 위해 아래와 같은 개인정보를 수집하고 있습니다.
    <br />
    <br />
    [회원 가입시]
    <br />
    수집항목: 이름, 생년월일, 자택전화번호, 휴대전화번호, 서비스이용기록,
    접속로그, 쿠키, 접속IP정보
    <br />
    [이벤트 참여시]
    <br />
    수집항목 : 이름, 전화번호
    <br />
    개인정보 수집방법: 상담문의, 이벤트참여
    <br />
    <br />
    개인정보의 수집 이용목적
    <br />
    병원은 수집한 개인정보를 다음의 목적을 위해 활용합니다.
    <br />
    ① 서비스 제공에 관한 계약 이행 및 서비스 제공
    <br />
    ② 마케팅 및 광고에 활용
    <br />
    신규서비스 개발 및 특화, 이벤트 등 광고성 정보 전달, 접속 빈도 파악 또는
    회원의 서비스 이용에 대한 통계
    <br />
    ③ 이벤트 참여시
    <br />
    병원에서 시술 상담활용(전화,문자)
    <br />
    <br />
    개인정보의 보유 및 이용기간
    <br />
    원칙적으로, 개인정보 수집 및 이용목적이 달성되거나 이벤트 참여시 이벤트
    페이지에 별도 명시한 수집동의 받은날로부터 동의받은 기간이 만료된 후에는
    <br />
    해당 정보를 지체 없이 파기합니다. 단, 다음의 정보에 대해서는 아래의 이유로
    명시한 기간 동안 보존합니다.
    <br />
    보존 항목 : 로그인ID
    <br />
    보존 근거 : 탈퇴후 같은 로그인ID로 재가입 불가
    <br />
    보존 기간 : 영구보존
    <br />
    개인정보의 파기 절차 및 방법
    <br />
    병원은 원칙적으로 개인정보 수집 및 이용목적이 달성된 후에는 해당 정보를 지체
    없이 파기합니다.
    <br />
    <br />
    파기절차 및 방법은 다음과 같습니다.
    <br />
    ① 파기절차
    <br />
    회원님이 회원가입 등을 위해 입력하신 정보는 목적이 달성된 후 별도의 DB로
    옮겨져(종이의 경우 별도의 서류함) 내부 방침 및 기타 관련 법령에 의한
    정보보호 사유에 따라 (보유 및 이용기간 참조) 일정 기간 저장된 후 파기됩니다.
    <br />
    별도 DB로 옮겨진 개인정보는 법률에 의한 경우가 아니고서는 보유되는 이외의
    다른 목적으로 이용되지 않습니다.
    <br />
    ② 파기방법
    <br />
    전자적 파일형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적 방법을
    사용하여 삭제합니다.
    <br />
    종이에 출력된 개인정보는 분쇄기로 분쇄하거나 소각을 통하여 파기합니다.
    <br />
    이용자 및 법정대리인의 권리와 그 행사방법
    <br />
    이용자는 언제든지 등록되어 있는 자신의 개인정보를 조회하거나 수정할 수
    있으며 가입 해지를 요청할 수도 있습니다. 이용자들의 개인정보 조회, 수정을
    위해서는 ‘개인정보변경’ (또는 ‘회원정보수정’ 등)을 가입 해지(동의철회)를
    위해서는 ‘회원탈퇴’를 클릭하여 본인 확인 절차를 거치신 후 직접 열람, 정정
    또는 탈퇴가 가능합니다. 혹은 개인정보관리책임자에게 서면, 전화 또는 이메일로
    연락 주시면 지체 없이 조치하겠습니다.
    <br />
    귀하가 개인정보의 오류에 대한 정정을 요청하신 경우에는 정정을 완료하기
    전까지 당해 개인정보를 이용 또는 제공하지 않습니다. 또한 잘못된 개인정보를
    제3자에게 이미 제공한 경우에는 정정 처리결과를 제3자에게 지체 없이 통지하여
    정정이 이루어지도록 하겠습니다.
    <br />
    개인정보 자동수집 장치의 설치, 운영 및 그 거부에 관한 사항
    <br />
    병원은 이용자의 정보를 수시로 저장하고 찾아내는 ‘쿠키(COOKIE)’ 등을
    운용합니다.
    <br />
    쿠키란 병원의 웹사이트를 운영하는데 이용되는 서버가 귀하의 브라우저에 보내는
    아주 작은 텍스트 파일로서 귀하의 컴퓨터 하드디스크에 저장됩니다. 병원은(은)
    다음과 같은 목적을
    <br />
    위해 쿠키를 사용합니다.
    <br />
    ① 쿠키 등 사용목적
    <br />
    회원과 비회원의 접속 빈도나 방문 시간 등을 분석, 이용자의 취향과 관심분야를
    파악 및 자취 추적, 각종 이벤트 참여 정도 및 방문 회수 파악 등을 통한 타켓
    마케팅 및 개인 맞춤 서비스 제공 이용자는 쿠키 설치에 대한 선택권을 가지고
    있습니다. 따라서, 이용자는 웹브라우저에서 옵션을 설정함으로써 모든 쿠키를
    허용하거나, 쿠키가 저장될 때마다 확인을 거치거나, 아니면 모든 쿠키의 저장을
    거부할 수도 있습니다.
    <br />
    ② 쿠키 설정 거부 방법
    <br />
    예: 쿠키 설정을 거부하는 방법으로는 이용자가 사용하시는 웹브라우저의 옵션을
    선택함으로써 모든 쿠키를 허용하거나 쿠키를 저장할 때마다 확인을 거치거나,
    모든 쿠키의 저장을 거부할 수 있습니다.
    <br />
    설정방법
    <br />
    예(인터넷 익스플로어의 경우): 웹브라우저 상단의 도구 &gt; 인터넷 옵션 &gt;
    개인정보 단, 이용자가 쿠키 설치를 거부하였을 경우 서비스 제공에 어려움이
    있을 수 있습니다.
    <br />
    <br />
    동의철회(회원탈퇴)
    <br />
    이용자가 회원 가입 시 개인정보의 수집, 이용 및 제공에 대해 동의하신 내용을
    언제든지 철회할 수 있습니다. 동의철회(회원탈퇴)는 로그인한 상황에서 병원
    웹사이트 상단 마이페이지 &gt; 개인정보 내용 하단에 회원탈퇴를 클릭하여
    비밀번호 확인 절차를 거치신 후 직접 동의철회(회원탈퇴)를 하시거나,
    개인정보관리책임자에게 이메일로 연락하시면 지체 없이 이용자의 개인정보를
    파기하는 등 필요한 조치를 취하겠습니다.
    <br />
    만 14세 미만 아동의 개인정보보호 관리
    <br />
    만 14세 미만의 아동으로부터 개인정보를 수집하거나, 그 아동의 개인정보를
    제3자에게 제공할 경우 만 14세 미만 아동의 법정대리인으로부터 동의를
    얻습니다. 이를 위해 병원은 그 아동에게 법정대리인의 동의를 얻기 위하여
    필요한 법정대리인의 성명 등 최소한의 정보를 요구할 수 있습니다. 법정대리인은
    그 아동이 제공한 개인정보에 대한 열람 또는 오류의 정정을 요구할 수 있으며,
    그 아동의 개인정보의 수집, 제3자에게 그 아동의 개인정보를 제공하는 것에 대한
    동의를 철회할 수 있습니다. 개인정보의 열람 또는 오류의 정정, 동의의 철회는
    개인정보변경에서 처리하실 수 있습니다.
    <br />
    <br />
    개인정보 관리책임자
    <br />
    고객의 개인정보를 보호하고 개인정보와 관련한 불만을 처리하기 위하여 병원은
    개인정보관리책임자를 두고 있습니다. 고객의 개인정보와 관련한 문의사항이
    있으시면 아래의 개인정보관리책임자 또는 개인정보관리담당자에게 연락 주시기
    바랍니다.
    <br />
    ① 개인정보 관리책임자
    <br />
    관리 책임자: 박영진 대표
    <br />
    취급 담당자: 박영진 대표
    <br />
    소속: 오블리브의원 대표
    <br />
    전화번호 : 032-851-9119
    <br />
    개인정보침해 관련 상담 및 신고
    <br />
    개인정보침해에 관한 상담이 필요한 경우에는 개인정보침해신고센터, 대검찰청
    인터넷범죄수사센터, 경찰청사이버테러대응센터 등으로 문의하실 수 있습니다.
    <br />
    개인정보침해신고센터 / PRIVACY.KISA.OR.KR / 국번없이 118
    <br />
    대검찰청 사이버수사과 / WWW.SPO.GO.KR / 국번없이 1301
    <br />
    경찰청 사이버안전국 / POLICE.GO.KR / 국번없이 182
    <br />
    부칙
    <br />
    법령, 정책 또는 보안기술의 변경에 따라 내용의 추가, 삭제 및 수정이 있을
    시에는 변경사항 시행일의 7일전부터 병원 웹사이트의 공지사항을 통하여
    고지합니다.
    <br />
    이 개인정보 취급방침은 2021년 05월 07일부터 적용됩니다.
    <br />
    개인정보 보호정책 시행일자 : 2021년 05월 07일
    <br />
    개인정보 보호정책 최종변경일자 : 2021년 05월 07일
  </div>
);

export default TermsPrivacy;
